"An error occurred. Please try again." = "Došlo je do pogreške. Molimo pokušajte ponovo.";

"Card brand was not updated. Please try again." = "Marka kartice nije ažurirana. Molimo pokušajte ponovo.";

"Close" = "Zatvori";

"Default payment method was not updated. Please try again." = "Zadani način plaćanja nije ažuriran. Molimo pokušajte ponovo.";

"Scan Card" = "Skeniraj karticu";

"Scan card" = "Skeniraj karticu";

"The IBAN you entered is invalid." = "Uneseni IBAN nije valjan.";

"There was an error processing your card -- try again in a few seconds" = "Došlo je do pogreške u obradi vaše kartice -- pokušajte ponovno za nekoliko sekundi";

"There was an unexpected error -- try again in a few seconds" = "Došlo je do neočekivane pogreške -- pokušajte ponovno za nekoliko sekundi";

"Try again" = "Pokušajte ponovo";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "Koristimo Stripe za provjeru vaših podataka o kartici. Stripe može koristiti i pohranjivati vaše podatke u skladu sa svojim pravilima privatnosti. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Saznajte više</u></a>";

"Your card has expired" = "Vaša kartica je istekla";

"Your card was declined" = "Kartica je odbijena";

"Your card's expiration month is invalid" = "Mjesec isteka kartice nije valjan";

"Your card's expiration year is invalid" = "Godina isteka kartice nije valjana";

"Your card's number is invalid" = "Broj kartice nije valjan";

"Your card's security code is invalid" = "Sigurnosni kod vaše kartice nije valjan";

"Your name is invalid." = "Vaše ime je neispravno.";

"Your payment method was declined." = "Vaš način plaćanja je odbijen.";
